week4_RAILS/urlshortener/app/controllers/links_controller.rb

SELECT  "links".* FROM "links"  WHERE "links"."longlink" = 'elpais.com' LIMIT 1
INSERT INTO "links" ("created_at", "longlink", "shortlink", "updated_at", "visited") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-11-18 21:52:58.831222"], ["longlink", "slack.es"], ["shortlink", "QIM"], ["updated_at", "2015-11-18 21:52:58.831222"], ["visited", 0]]
---
  def create
    if Link.check_already_exist(params[:link][:long]) == false
      flash[:alert] = "Error, URL already created"
      @short_link = Link.find_by(longlink: params[:link][:long]).shortlink
      render 'index'
    else
      Link.create_url(params[:link][:long])

SELECT "links".* FROM "links"
---
  def visited_pages
    @visited_pages = Link.all