week4_RAILS/timetracking_app/app/controllers/entries_controller.rb

SELECT  "projects".* FROM "projects"  WHERE (61) LIMIT 1
SELECT  "entries".* FROM "entries"  WHERE (project_id = '61')  ORDER BY "entries"."id" ASC LIMIT 1
SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 64]]
---
  def index
    @project = Project.find_by(params[:project_id])
    @entries = Project.find(params[:project_id]).entries

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 111]]
INSERT INTO "entries" ("created_at", "date", "hours", "minutes", "project_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-11-18 13:41:34.515876"], ["date", "2015-11-02 00:00:00.000000"], ["hours", 6], ["minutes", 6], ["project_id", 111], ["updated_at", "2015-11-18 13:41:34.515876"]]
---
  def create

    @project = Project.find(params[:project_id])
    @entry = @project.entries.new(entry_params) #STRONG PARAMS

    if @entry.save

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 101]]
SELECT  "entries".* FROM "entries"  WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 101], ["id", 101]]
---
  def edit
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 101]]
SELECT  "entries".* FROM "entries"  WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 101], ["id", 102]]
UPDATE "entries" SET "hours" = ?, "minutes" = ?, "updated_at" = ? WHERE "entries"."id" = 102  [["hours", 11], ["minutes", 22], ["updated_at", "2015-11-18 16:09:18.833347"]]
---
  def update
      @project = Project.find(params[:project_id])
      @entry = @project.entries.find(params[:id])

    if @entry.update_attributes(entry_params)

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 101]]
SELECT  "entries".* FROM "entries"  WHERE "entries"."project_id" = ? AND "entries"."id" = ? LIMIT 1  [["project_id", 101], ["id", 101]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 101]]
---
  def destroy
    @project = Project.find(params[:project_id])
    @entry = @project.entries.find(params[:id])

    @entry.destroy