week4_RAILS/timetracking_app/app/controllers/people_controller.rb

SELECT "projects".* FROM "projects"
---
  def show
    @person = Person.find_by(id: params[:id])
    @projects_not_associated = @person.select_not_associatted_projects

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 106]]
---
  def update
    @project = Project.find(params[:person][:projects])